nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/adchs/processor/adchs_p32mz2025dab176.h
    ADCHS_DEFAULT_CLASS1_AN0 = 0,
    ADCHS_ALTERNATE_CLASS1_AN45 = 1

} ADCHS_CHANNEL_0_INP_SEL;

typedef enum {

    ADCHS_DEFAULT_CLASS1_AN1 = 4,
    ADCHS_ALTERNATE_CLASS1_AN46 = 5

} ADCHS_CHANNEL_1_INP_SEL;

typedef enum {

    ADCHS_DEFAULT_CLASS1_AN2 = 8,
    ADCHS_ALTERNATE_CLASS1_AN47 = 9

} ADCHS_CHANNEL_2_INP_SEL;

typedef enum {

    ADCHS_DEFAULT_CLASS1_AN3 = 12,
    ADCHS_ALTERNATE_CLASS1_AN48 = 13

} ADCHS_CHANNEL_3_INP_SEL;

typedef enum {

    ADCHS_DEFAULT_CLASS1_AN4 = 16,
    ADCHS_ALTERNATE_CLASS1_AN49 = 17

} ADCHS_CHANNEL_4_INP_SEL;

typedef enum {

    ADCHS_CHANNEL_5_INP_SEL_NONE

} ADCHS_CHANNEL_5_INP_SEL;

typedef enum {

    ADCHS_CHANNEL_UNSYNC_TRIGGER_UNSYNC_SAMPLING = 0,
    ADCHS_CHANNEL_SYNC_SAMPLING = 1,
    ADCHS_CHANNEL_SYNC_TRIGGER_UNSYNC_SAMPLING = 2

} ADCHS_CHANNEL_TRIGGER_SAMPLING_SEL;

typedef enum {

    ADCHS_INPUT_MODE_SINGLE_ENDED_UNIPOLAR = 0,
    ADCHS_INPUT_MODE_SINGLE_ENDED_TWOS_COMP = 1,
    ADCHS_INPUT_MODE_DIFFERENTIAL_UNIPOLAR = 2,
    ADCHS_INPUT_MODE_DIFFERENTIAL_TWOS_COMP = 3

} ADCHS_INPUT_MODE;

typedef enum {

    ADCHS_DIGITAL_COMPARATOR_1 = 0,
    ADCHS_DIGITAL_COMPARATOR_2 = 1,
    ADCHS_DIGITAL_COMPARATOR_3 = 2,
    ADCHS_DIGITAL_COMPARATOR_4 = 3,
    ADCHS_DIGITAL_COMPARATOR_5 = 4,
    ADCHS_DIGITAL_COMPARATOR_6 = 5

} ADCHS_DIGITAL_COMPARATOR_ID;

typedef enum {

    ADCHS_DIGITAL_FILTER_1 = 0,
    ADCHS_DIGITAL_FILTER_2 = 1,
    ADCHS_DIGITAL_FILTER_3 = 2,
    ADCHS_DIGITAL_FILTER_4 = 3,
    ADCHS_DIGITAL_FILTER_5 = 4,
    ADCHS_DIGITAL_FILTER_6 = 5

} ADCHS_DIGITAL_FILTER_ID;

typedef enum {

    ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO_2X = 4,
    ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO_4X = 0,
    ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO_8X = 5,
    ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO_16X = 1,
    ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO_32X = 6,
    ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO_64X = 2,
    ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO_128X = 7,
    ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO_256X = 3

} ADCHS_DIGITAL_FILTER_OVERSAMPLE_RATIO;

typedef enum {

    ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT_2 = 0,
    ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT_4 = 1,
    ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT_8 = 2,
    ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT_16 = 3,
    ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT_32 = 4,
    ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT_64 = 5,
    ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT_128 = 6,
    ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT_256 = 7

} ADCHS_DIGITAL_FILTER_AVERAGE_SAMPLE_COUNT;

typedef enum {

    ADCHS_DIGITAL_FILTER_SIGNIFICANT_FIRST_12BITS = 0,
    ADCHS_DIGITAL_FILTER_SIGNIFICANT_ALL_16BITS = 1

} ADCHS_DIGITAL_FILTER_SIGNIFICANT_BITS;

typedef enum {

    ADCHS_SCAN_TRIGGER_SENSITIVE_EDGE = 0,
    ADCHS_SCAN_TRIGGER_SENSITIVE_LEVEL = 1

} ADCHS_SCAN_TRIGGER_SENSITIVE;

typedef enum {

    ADCHS_WARMUP_CLOCK_16 = 0,
    ADCHS_WARMUP_CLOCK_32 = 5,
    ADCHS_WARMUP_CLOCK_64 = 6,
    ADCHS_WARMUP_CLOCK_128 = 7,
    ADCHS_WARMUP_CLOCK_256 = 8,
    ADCHS_WARMUP_CLOCK_512 = 9,
    ADCHS_WARMUP_CLOCK_1024 = 10,
    ADCHS_WARMUP_CLOCK_2048 = 11,
    ADCHS_WARMUP_CLOCK_4096 = 12,
    ADCHS_WARMUP_CLOCK_8192 = 13,
    ADCHS_WARMUP_CLOCK_16384 = 14,
    ADCHS_WARMUP_CLOCK_32768 = 15

} ADCHS_WARMUP_CLOCK;

typedef enum {

    ADCHS_TRIGGER_SOURCE_NONE = 0,
    ADCHS_TRIGGER_SOURCE_GLOBAL_SOFTWARE_EDGE = 1,
    ADCHS_TRIGGER_SOURCE_SOFTWARE_LEVEL = 2,
    ADCHS_TRIGGER_SOURCE_SCAN = 3,
    ADCHS_TRIGGER_SOURCE_INT0 = 4,
    ADCHS_TRIGGER_SOURCE_TMR1_MATCH = 5,
    ADCHS_TRIGGER_SOURCE_TMR3_MATCH = 6,
    ADCHS_TRIGGER_SOURCE_TMR5_MATCH = 7,
    ADCHS_TRIGGER_SOURCE_OC1 = 8,
    ADCHS_TRIGGER_SOURCE_OC3 = 9,
    ADCHS_TRIGGER_SOURCE_OC5 = 10,
    ADCHS_TRIGGER_SOURCE_COUT1 = 11,
    ADCHS_TRIGGER_SOURCE_COUT2 = 12,
    ADCHS_TRIGGER_SOURCE_CTMU = 13

} ADCHS_TRIGGER_SOURCE;

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/adchs_Registers_Default.h"
#include "../templates/adchs_EnableControl_Default.h"
#include "../templates/adchs_TurboMode_Default.h"
#include "../templates/adchs_DigitalComparator_Default.h"
#include "../templates/adchs_DigitalFilter_Default.h"
#include "../templates/adchs_FIFO_Default.h"
#include "../templates/adchs_DMA_Unsupported.h"
#include "../templates/adchs_CVD_Default.h"
#include "../templates/adchs_VREFControl_Default.h"
#include "../templates/adchs_AnalogInputScan_Default.h"
#include "../templates/adchs_AnalogFeatureControl_Default.h"
#include "../templates/adchs_DigitalFeatureControl_Default.h"
#include "../templates/adchs_AnalogInputModeControl_Default.h"
#include "../templates/adchs_TriggerControl_Default.h"
#include "../templates/adchs_ChannelTriggerSampleControl_Default.h"
#include "../templates/adchs_EarlyInterruptControl_Default.h"
#include "../templates/adchs_ManualControl_Default.h"
#include "../templates/adchs_UpdateReadyControl_Default.h"
#include "../templates/adchs_InputControl_Default.h"
#include "../templates/adchs_ExternalConversionRequest_Unsupported.h"
#include "../templates/adchs_Setup_PIC32MZ_DA.h"
#include "../templates/adchs_AnalogInputCheck_Default.h"
#include "../templates/adchs_ChannelConfiguration_Default.h"
#include "../templates/adchs_ConversionResult_Default.h"
#include "../templates/adchs_ScanEnable_Unsupported.h"

/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API bool PLIB_ADCHS_ExistsRegisters(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsRegisters_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_Enable(ADCHS_MODULE_ID index)
{
     ADCHS_Enable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_Disable(ADCHS_MODULE_ID index)
{
     ADCHS_Disable_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsEnableControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsEnableControl_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_TurboModeEnable(ADCHS_MODULE_ID index)
{
     ADCHS_TurboModeEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_TurboModeDisable(ADCHS_MODULE_ID index)
{
     ADCHS_TurboModeDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_TurboModeErrorHasOccurred(ADCHS_MODULE_ID index)
{
     return ADCHS_TurboModeErrorHasOccurred_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_TurboModeChannelSelect(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID masterChannelID, ADCHS_CHANNEL_ID slaveChannelID)
{
     return ADCHS_TurboModeChannelSelect_Default(index, masterChannelID, slaveChannelID);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsTurboMode(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsTurboMode_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorAnalogInputSelect(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID digComparator, ADCHS_AN_INPUT_ID analogInput)
{
     ADCHS_DigitalComparatorAnalogInputSelect_Default(index, digComparator, analogInput);
}

PLIB_INLINE_API ADCHS_AN_INPUT_ID PLIB_ADCHS_DigitalComparatorAnalogInputGet(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID digComparator)
{
     return ADCHS_DigitalComparatorAnalogInputGet_Default(index, digComparator);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorEnable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID digComparator)
{
     ADCHS_DigitalComparatorEnable_Default(index, digComparator);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorDisable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID digComparator)
{
     ADCHS_DigitalComparatorDisable_Default(index, digComparator);
}

PLIB_INLINE_API void PLIB_ADCHS_DigitalComparatorInterruptEnable(ADCHS_MODULE_ID index, ADCHS_DIGITAL_COMPARATOR_ID digComparator)
{
     ADCHS_DigitalComparatorInterruptEnable_Default(index, digComparator);
}

